---
title: ColorOptions
classe: Autodesk.Revit.DB.ColorOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ColorOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color AlertColor { get; set; }` | `colorOptions.AlertColor` | Color |
| `Color BackgroundColor { get; set; }` | `colorOptions.BackgroundColor` | Color |
| `Color CalculatingColor { get; set; }` | `colorOptions.CalculatingColor` | Color |
| `Color EditingColor { get; set; }` | `colorOptions.EditingColor` | Color |
| `Boolean IsValidObject { get; }` | `colorOptions.IsValidObject` | Boolean |
| `Color PreselectionColor { get; set; }` | `colorOptions.PreselectionColor` | Color |
| `Color SelectionColor { get; set; }` | `colorOptions.SelectionColor` | Color |
| `Boolean SelectionSemitransparent { get; set; }` | `colorOptions.SelectionSemitransparent` | Boolean |
| `Void Dispose()` | `colorOptions.Dispose()` | Void |
| `ColorOptions GetColorOptions()` | `ColorOptions.GetColorOptions()` | ColorOptions |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```